wyniki_50G_article/fio_results_xfs_nvme/block_size_1024/lab-sec-14/fio_database_article_test_output.txt
database_article_test: (g=0): rw=randrw, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=128
fio-3.36
Starting 1 process
database_article_test: Laying out IO file (1 file / 51200MiB)

database_article_test: (groupid=0, jobs=1): err= 0: pid=89824: Mon Apr 21 03:50:51 2025
  read: IOPS=9828, BW=76.8MiB/s (80.5MB/s)(13.5GiB/180001msec)
    slat (usec): min=2, max=112233, avg=20.49, stdev=770.27
    clat (usec): min=127, max=821082, avg=6002.28, stdev=16096.01
     lat (usec): min=141, max=821148, avg=6022.76, stdev=16113.45
    clat percentiles (usec):
     |  1.00th=[   947],  5.00th=[  1500], 10.00th=[  1778], 20.00th=[  2147],
     | 30.00th=[  2474], 40.00th=[  2769], 50.00th=[  3032], 60.00th=[  3326],
     | 70.00th=[  3654], 80.00th=[  4113], 90.00th=[  5145], 95.00th=[ 15664],
     | 99.00th=[ 93848], 99.50th=[101188], 99.90th=[114820], 99.95th=[123208],
     | 99.99th=[459277]
   bw (  KiB/s): min=  704, max=100608, per=100.00%, avg=78737.00, stdev=13188.39, samples=359
   iops        : min=   88, max=12576, avg=9842.02, stdev=1648.59, samples=359
  write: IOPS=9818, BW=76.7MiB/s (80.4MB/s)(13.5GiB/180001msec); 0 zone resets
    slat (usec): min=2, max=126361, avg=22.52, stdev=833.85
    clat (usec): min=78, max=1007.9k, avg=6982.51, stdev=18491.12
     lat (usec): min=96, max=1008.0k, avg=7005.03, stdev=18508.92
    clat percentiles (usec):
     |  1.00th=[   506],  5.00th=[  1221], 10.00th=[  1680], 20.00th=[  2278],
     | 30.00th=[  2704], 40.00th=[  3032], 50.00th=[  3294], 60.00th=[  3556],
     | 70.00th=[  3916], 80.00th=[  4555], 90.00th=[  6063], 95.00th=[ 17695],
     | 99.00th=[ 96994], 99.50th=[104334], 99.90th=[117965], 99.95th=[130548],
     | 99.99th=[574620]
   bw (  KiB/s): min=  704, max=102064, per=100.00%, avg=78654.83, stdev=13160.51, samples=359
   iops        : min=   88, max=12758, avg=9831.73, stdev=1645.10, samples=359
  lat (usec)   : 100=0.01%, 250=0.04%, 500=0.49%, 750=0.60%, 1000=1.19%
  lat (msec)   : 2=12.88%, 4=59.54%, 10=18.70%, 20=2.83%, 50=0.41%
  lat (msec)   : 100=2.64%, 250=0.65%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2000=0.01%
  cpu          : usr=6.04%, sys=22.41%, ctx=411521, majf=0, minf=13
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=1769053,1767297,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=76.8MiB/s (80.5MB/s), 76.8MiB/s-76.8MiB/s (80.5MB/s-80.5MB/s), io=13.5GiB (14.5GB), run=180001-180001msec
  WRITE: bw=76.7MiB/s (80.4MB/s), 76.7MiB/s-76.7MiB/s (80.4MB/s-80.4MB/s), io=13.5GiB (14.5GB), run=180001-180001msec

Disk stats (read/write):
  nvme0n1: ios=1768319/1766538, sectors=28293104/28264354, merge=4/8, ticks=9469872/10996925, in_queue=20466993, util=80.26%